<a href="https://colab.research.google.com/github/Jikhan-Jeong/Python-Algorithm/blob/master/Jan_24%2C_2020_Pandas_Groupby_for_unique_values_count.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

----
# Jan 24, 2020 Pandas Groupby for unique values count
* Name: Jikhan Jeong
* Ref; https://stackoverflow.com/questions/38309729/count-unique-values-with-pandas-per-groups
----

In [11]:
import pandas as pd
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

             name  year  reports
Cochice     Jason  2012        4
Pima        Molly  2012       24
Santa Cruz   Tina  2013       31
Maricopa     Jake  2014        2
Yuma          Amy  2014        3

In [17]:

df1 = df.groupby('year')['name'].nunique()
df1

year
2012    2
2013    1
2014    2
Name: name, dtype: int64

In [22]:
df1.iloc[:]

year
2012    2
2013    1
2014    2
Name: name, dtype: int64